content-org/scripting.org
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_SECTION: scripting
#+HUGO_PAIRED_SHORTCODES: katex
#+OPTIONS: ^:{}
#+PROPERTY: header-args:jupyter-julia :session jl :exports both :eval no-export :async yes

* Scripting Workflow
:PROPERTIES:
:EXPORT_FILE_NAME: scripting-workflow
:END:

The following steps are often useful for working on code:

1. Write some code
2. Test the code interactively
3. Repeat

** Script + REPL

For example, say you're working on some code in a file named =work.jl=

#+begin_src julia :exports code :results none
# work.jl

function foo(a, b, c)
    # lots of code
end

function bar(x, y)
    # lots of code
end
#+end_src

Now, you can start up a REPL and ~include~ the =work.jl= file.

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>include("work.jl")
</pre>
#+END_EXPORT

You can now test the ~foo~ and ~bar~ functions in the REPL.

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>foo(1, 2, 3)

<font color="#98C379"><b>julia&gt; </b></font>bar(64, 128)

</pre>
#+END_EXPORT

** Jupyter Notebook

Since a text editor is integrated into a jupyter notebook, you can skip the ~include~ step and write your code directly into a cell. Note that you cannot include jupyter notebooks from other files. If you want to use your code elsewhere, you'll have to put it in a Julia file.
